NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_network_vectors.c
static bool m_core_tx_alloc_success;

/*************** Additional Mock Functions ***************/

timestamp_t timer_now(void)
{
    return 0;
}

static struct
{
    packet_mesh_trs_packet_t packet;
    network_packet_metadata_t net_metadata;
    uint32_t calls;
} m_transport_packet_in;

uint32_t transport_packet_in_mock_cb(const packet_mesh_trs_packet_t * p_packet,
                                     uint32_t trs_packet_len,
                                     const network_packet_metadata_t * p_net_metadata,
                                     const nrf_mesh_rx_metadata_t * p_rx_metadata,
                                     int cmock_num_calls)
{
    memcpy(&m_transport_packet_in.packet, p_packet, trs_packet_len);
    memcpy(&m_transport_packet_in.net_metadata, p_net_metadata, sizeof(network_packet_metadata_t));
    m_transport_packet_in.calls++;
    return NRF_SUCCESS;
}

static packet_mesh_net_packet_t m_core_tx_buffer;

core_tx_bearer_bitmap_t core_tx_packet_alloc_cb(const core_tx_alloc_params_t * p_params,
                                                uint8_t ** pp_packet,
                                                int calls)
{
    *pp_packet = (uint8_t *) &m_core_tx_buffer;
    return m_core_tx_alloc_success;
}

/*************** Static Helper Functions and Types ***************/

/*
 * Provisions the test network. Will use test vector keys if indicated, otherwise, it'll be dummies.
 */
static void provision(bool use_real_keys)
{
    if (use_real_keys)
    {
        uint8_t privacy[] = TEST_PRIVACY_KEY;
        uint8_t encryption[] = TEST_ENCRYPTION_KEY;
        test_network.nid = TEST_NID;
        memcpy(test_network.privacy_key, privacy, NRF_MESH_KEY_SIZE);
        memcpy(test_network.encryption_key, encryption, NRF_MESH_KEY_SIZE);
    }
    else
    {
        memset(test_network.privacy_key, 0x11, NRF_MESH_KEY_SIZE);
        memset(test_network.encryption_key, 0x22, NRF_MESH_KEY_SIZE);
        test_network.nid = 0x12;
    }
}

void nrf_mesh_net_secmat_next_get(uint8_t nid, const nrf_mesh_network_secmat_t ** pp_secmat)
{
    TEST_ASSERT_TRUE(m_net_secmat_get_calls_expect > 0);
    TEST_ASSERT_NOT_NULL(mp_net_secmats);
    TEST_ASSERT_NOT_EQUAL(0, m_net_secmat_count);
    m_net_secmat_get_calls_expect--;

    if (*pp_secmat == NULL)
    {
        *pp_secmat = &mp_net_secmats[0];
    }
    else if ((uint32_t)(*pp_secmat - &mp_net_secmats[0]) >= m_net_secmat_count - 1)
    {
        *pp_secmat = NULL;
    }
    else
    {
        (*pp_secmat)++; /* get next */
    }
}

bool nrf_mesh_rx_address_get(uint16_t address, nrf_mesh_address_t * p_address)
{
    return (m_rx_address == address);
}


/*************** Test Initialization and Finalization ***************/

void setUp(void)
{
    core_tx_mock_Init();
    core_tx_adv_mock_Init();
    msg_cache_mock_Init();
    transport_mock_Init();
    net_state_mock_Init();
    net_beacon_mock_Init();
    heartbeat_mock_Init();

    m_net_secmat_get_calls_expect = 0;
    mp_net_secmats = NULL;
    m_net_secmat_count = 0;
    m_rx_address = 0;
    m_core_tx_alloc_success = true;

    __LOG_INIT((LOG_SRC_NETWORK | LOG_SRC_ENC | LOG_SRC_TEST), 3, LOG_CALLBACK_DEFAULT);

    nrf_mesh_init_params_t init_params;
    memset(&init_params, 0, sizeof(nrf_mesh_init_params_t));

    net_state_init_Expect();
    net_beacon_init_Expect();
    network_init(&init_params);
}

void tearDown(void)
{
    core_tx_mock_Verify();
    core_tx_mock_Destroy();
    core_tx_adv_mock_Verify();
    core_tx_adv_mock_Destroy();
    msg_cache_mock_Verify();
    msg_cache_mock_Destroy();
    transport_mock_Verify();
    transport_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    net_beacon_mock_Verify();
    net_beacon_mock_Destroy();
    heartbeat_mock_Verify();
    heartbeat_mock_Destroy();
}

/*************** Test Cases ***************/

void test_packet_in(void)
{
    nrf_mesh_rx_metadata_t rx_metadata;
    const uint8_t run_testvectors[] = NETWORK_PKT_IN_TEST_VECTORS;
    provision(true);

    transport_packet_in_StubWithCallback(transport_packet_in_mock_cb);
    core_tx_packet_alloc_StubWithCallback(core_tx_packet_alloc_cb);
    core_tx_packet_send_Ignore();

    mp_net_secmats = &test_network;
    m_net_secmat_count = 1;
    /* Processes all the test vectors as incoming packets. */
    for (unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        msg_cache_entry_exists_IgnoreAndReturn(false);
        msg_cache_entry_add_Expect(test_vector.metadata.src, test_vector.metadata.internal.sequence_number);

        m_net_secmat_get_calls_expect = 1;

        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.metadata.internal.iv_index & 0x01, test_vector.metadata.internal.iv_index);

        core_tx_adv_is_enabled_ExpectAndReturn(CORE_TX_ROLE_RELAY, true);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_packet_in(test_vector.p_encrypted_packet, test_vector.lengths.encrypted, &rx_metadata));

        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);

        TEST_ASSERT_EQUAL_METADATA(test_vector.metadata, m_transport_packet_in.net_metadata);
        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_transport_packet, &m_transport_packet_in.packet, test_vector.lengths.transport);
    }

    /* Add more networks, make sure we hit the right one for all test vectors. */
    nrf_mesh_network_secmat_t secmats[4];
    memset(&secmats[0], 0x12, sizeof(nrf_mesh_network_secmat_t));
    memset(&secmats[1], 0x34, sizeof(nrf_mesh_network_secmat_t));
    memcpy(&secmats[2], &test_network, sizeof(nrf_mesh_network_secmat_t));
    memset(&secmats[3], 0x56, sizeof(nrf_mesh_network_secmat_t));
    mp_net_secmats = secmats;
    m_net_secmat_count = 4;

    for (unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

