NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_network_vectors.c
        msg_cache_entry_exists_IgnoreAndReturn(false);
        msg_cache_entry_add_Expect(test_vector.metadata.src, test_vector.metadata.internal.sequence_number);

        m_net_secmat_get_calls_expect = 3;

        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.metadata.internal.iv_index & 0x01, test_vector.metadata.internal.iv_index);
        core_tx_adv_is_enabled_ExpectAndReturn(CORE_TX_ROLE_RELAY, true);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_packet_in(test_vector.p_encrypted_packet, test_vector.lengths.encrypted, &rx_metadata));

        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);

        TEST_ASSERT_EQUAL_METADATA(test_vector.metadata, m_transport_packet_in.net_metadata);
        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_transport_packet, &m_transport_packet_in.packet, test_vector.lengths.transport);
    }
}

void test_packet_out(void)
{
    const uint8_t run_testvectors[] = NETWORK_PKT_OUT_TEST_VECTORS;
    provision(true);

    m_core_tx_alloc_success = true;
    core_tx_packet_alloc_StubWithCallback(core_tx_packet_alloc_cb);
    core_tx_packet_send_Ignore();

    net_state_iv_index_lock_Ignore();

    /* Processes all the test vectors as outbound packets. */
    for (unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        net_state_tx_iv_index_get_ExpectAndReturn(test_vector.metadata.internal.iv_index);

        net_state_seqnum_alloc_ExpectAndReturn(NULL, NRF_SUCCESS);
        net_state_seqnum_alloc_IgnoreArg_p_seqnum();
        net_state_seqnum_alloc_ReturnMemThruPtr_p_seqnum(
            &test_vector.metadata.internal.sequence_number,
            sizeof(test_vector.metadata.internal.sequence_number));

        network_tx_packet_buffer_t net_packet_buffer;
        net_packet_buffer.user_data.p_metadata = &test_vector.metadata;
        net_packet_buffer.user_data.payload_len = test_vector.lengths.transport;
        net_packet_buffer.user_data.role = CORE_TX_ROLE_ORIGINATOR;
        net_packet_buffer.user_data.bearer_selector = CORE_TX_BEARER_TYPE_ADV;

        memcpy(&m_core_tx_buffer.pdu[9],
               test_vector.p_transport_packet,
               test_vector.lengths.transport);
        test_vector.metadata.p_security_material = &test_network;

        TEST_ASSERT_EQUAL(NRF_SUCCESS, network_packet_alloc(&net_packet_buffer));

        network_packet_send(&net_packet_buffer);

        TEST_ASSERT_EQUAL_MEMORY(test_vector.p_encrypted_packet, &m_core_tx_buffer, test_vector.lengths.encrypted);

        net_state_mock_Verify();
    }

    /* Fail sending */
    m_core_tx_alloc_success = false;
    for (unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "Running test vector %d\n", run_testvectors[i]);

        network_tx_packet_buffer_t net_packet_buffer;
        net_packet_buffer.user_data.p_metadata = &test_vector.metadata;
        net_packet_buffer.user_data.p_metadata->p_security_material = &test_network;
        net_packet_buffer.user_data.payload_len = test_vector.lengths.transport;
        net_packet_buffer.user_data.role = CORE_TX_ROLE_ORIGINATOR;

        TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, network_packet_alloc(&net_packet_buffer));
    }
}

void test_invalid_net_key_in(void)
{
    nrf_mesh_rx_metadata_t rx_metadata;
    const uint8_t run_testvectors[] = INVALID_NETKEY_TEST_VECTORS;

    provision(false);

    transport_packet_in_StubWithCallback(transport_packet_in_mock_cb);
    msg_cache_entry_exists_IgnoreAndReturn(false);

    mp_net_secmats = &test_network;
    m_net_secmat_count = 1;

    /* Processes all the test vectors as incoming packets. */
    for (unsigned int i = 0; i < sizeof(run_testvectors); ++i)
    {
        test_vector_t test_vector;
        get_test_vector(run_testvectors[i], &test_vector);

        m_transport_packet_in.calls   = 0;
        m_net_secmat_get_calls_expect = 2;

        net_state_rx_iv_index_get_ExpectAndReturn(test_vector.metadata.internal.iv_index & 0x01, test_vector.metadata.internal.iv_index);

        TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, network_packet_in(test_vector.p_encrypted_packet, test_vector.lengths.encrypted, &rx_metadata));

        TEST_ASSERT_EQUAL(0, m_transport_packet_in.calls);
        TEST_ASSERT_EQUAL(0, m_net_secmat_get_calls_expect);
    }
}
